[
  {
    "title": "Wireless Noise Cancelling Bluetooth Headphones",
    "price": 2499,
    "category": "Electronics",
    "brand": "SoundMax",
    "rating": 4.5,
    "reviews": 186,
    "stock": 35,
    "image": "/products/headphone.jpg",
    "description": "Experience immersive sound with these wireless noise cancelling Bluetooth headphones. Designed for comfort and long listening sessions, they feature soft ear cushions, adjustable headband, and advanced noise isolation technology. With up to 30 hours of battery life, fast charging support, and crystal-clear microphone quality, these headphones are perfect for music lovers, gamers, and professionals alike."
  },
  {
    "title": "Smart Fitness Watch with Heart Rate Monitor",
    "price": 3899,
    "category": "Electronics",
    "brand": "FitPro",
    "rating": 4.6,
    "reviews": 240,
    "stock": 20,
    "image": "/products/smartwatch.jpg",
    "description": "This smart fitness watch helps you stay on top of your health and daily activities. It tracks steps, calories, heart rate, sleep patterns, and workout performance with high accuracy. The water-resistant design, long battery life, and bright display make it ideal for everyday wear. Compatible with both Android and iOS devices for seamless connectivity."
  },
  {
    "title": "Men’s Casual Sneakers for Everyday Wear",
    "price": 2999,
    "category": "Fashion",
    "brand": "UrbanWalk",
    "rating": 4.3,
    "reviews": 154,
    "stock": 50,
    "image": "/products/sneakers.jpg",
    "description": "These men’s casual sneakers combine style, comfort, and durability. Crafted with breathable materials and a cushioned sole, they provide all-day comfort whether you’re walking, commuting, or hanging out with friends. The modern design pairs well with jeans, chinos, or casual outfits, making them a versatile addition to your wardrobe."
  },
  {
    "title": "Women’s Premium Leather Handbag",
    "price": 1999,
    "category": "Fashion",
    "brand": "Elegance",
    "rating": 4.4,
    "reviews": 121,
    "stock": 28,
    "image": "/products/handbag.jpg",
    "description": "A stylish and elegant handbag designed for modern women. Made from high-quality leather with strong stitching, this bag offers durability and a luxurious feel. It features multiple compartments to keep your essentials organized, making it suitable for office, shopping, or special occasions."
  },
  {
    "title": "Adjustable LED Desk Lamp with Eye Care Mode",
    "price": 1299,
    "category": "Home & Living",
    "brand": "BrightLite",
    "rating": 4.2,
    "reviews": 98,
    "stock": 40,
    "image": "/products/lamp.jpg",
    "description": "This LED desk lamp is designed to provide optimal lighting while reducing eye strain. It features adjustable brightness levels, flexible angles, and an energy-efficient LED system. Ideal for reading, studying, or working late hours, this lamp blends modern design with practical functionality."
  },
  {
    "title": "Non-Stick Aluminum Cooking Pan",
    "price": 1799,
    "category": "Kitchen",
    "brand": "CookEase",
    "rating": 4.5,
    "reviews": 210,
    "stock": 25,
    "image": "/products/pan.jpg",
    "description": "Cook healthy and delicious meals with this premium non-stick aluminum pan. The durable coating ensures easy food release and effortless cleaning. Compatible with gas and induction stoves, it distributes heat evenly for consistent cooking results."
  },
  {
    "title": "100% Cotton Bed Sheet Set – Queen Size",
    "price": 2199,
    "category": "Home & Living",
    "brand": "SleepWell",
    "rating": 4.6,
    "reviews": 175,
    "stock": 18,
    "image": "/products/bedsheet.jpg",
    "description": "Enjoy a comfortable and refreshing sleep with this 100% cotton bed sheet set. The breathable fabric feels soft against the skin and remains cool throughout the night. Designed to retain color and softness even after multiple washes."
  },
  {
    "title": "Portable Bluetooth Speaker with Deep Bass",
    "price": 2699,
    "category": "Electronics",
    "brand": "BeatBox",
    "rating": 4.4,
    "reviews": 142,
    "stock": 30,
    "image": "/products/speaker.jpg",
    "description": "This portable Bluetooth speaker delivers powerful sound with enhanced bass in a compact design. Perfect for indoor and outdoor use, it offers stable connectivity, long battery life, and a rugged build for travel and parties."
  },
  {
    "title": "Classic Men’s Analog Wrist Watch",
    "price": 3499,
    "category": "Accessories",
    "brand": "TimeX",
    "rating": 4.3,
    "reviews": 88,
    "stock": 22,
    "image": "/products/watch.jpg",
    "description": "A timeless analog wrist watch featuring a sleek dial and premium leather strap. Designed for elegance and durability, this watch complements both formal and casual outfits, making it suitable for office, events, and daily wear."
  },
  {
    "title": "Women’s Lightweight Running Shoes",
    "price": 3299,
    "category": "Sports",
    "brand": "RunFlex",
    "rating": 4.5,
    "reviews": 133,
    "stock": 34,
    "image": "/products/runningshoes.jpg",
    "description": "Designed for performance and comfort, these running shoes feature breathable fabric, cushioned soles, and excellent grip. Ideal for jogging, workouts, and long walks, they provide stability and reduce impact on joints."
  },
  {
    "title": "Fast Boil Electric Kettle – 1.5L",
    "price": 1899,
    "category": "Kitchen",
    "brand": "HomeHeat",
    "rating": 4.4,
    "reviews": 201,
    "stock": 27,
    "image": "/products/kettle.jpg",
    "description": "This electric kettle boils water quickly and efficiently, saving time and energy. It features automatic shut-off, overheat protection, and a sleek stainless-steel body. Perfect for tea, coffee, and instant meals."
  },
  {
    "title": "Ergonomic Office Chair with Lumbar Support",
    "price": 6499,
    "category": "Furniture",
    "brand": "WorkEase",
    "rating": 4.6,
    "reviews": 74,
    "stock": 12,
    "image": "/products/chair.jpg",
    "description": "Work comfortably for long hours with this ergonomic office chair. It features adjustable height, breathable mesh back, and lumbar support to reduce back strain. Ideal for home offices and professional workspaces."
  },
  {
    "title": "Water-Resistant Laptop Backpack",
    "price": 2499,
    "category": "Accessories",
    "brand": "CarryPro",
    "rating": 4.5,
    "reviews": 165,
    "stock": 45,
    "image": "/products/backpack.jpg",
    "description": "A durable and stylish backpack designed to protect your laptop and essentials. It includes padded compartments, water-resistant fabric, and comfortable shoulder straps, making it perfect for students and professionals."
  },
  {
    "title": "Wireless Optical Mouse",
    "price": 999,
    "category": "Electronics",
    "brand": "ClickPro",
    "rating": 4.2,
    "reviews": 190,
    "stock": 60,
    "image": "/products/mouse.jpg",
    "description": "This wireless optical mouse offers smooth tracking and responsive clicks. Its ergonomic design ensures comfort during extended use, making it suitable for office work, study, and casual gaming."
  },
  {
    "title": "Ceramic Coffee Mug – 350ml",
    "price": 499,
    "category": "Kitchen",
    "brand": "DailySip",
    "rating": 4.1,
    "reviews": 90,
    "stock": 80,
    "image": "/products/mug.jpg",
    "description": "Enjoy your favorite hot beverages with this stylish ceramic coffee mug. Designed to retain heat and resist stains, it is perfect for daily use at home or office."
  },
  {
    "title": "Non-Slip Yoga Mat for Home Workout",
    "price": 1499,
    "category": "Sports",
    "brand": "FlexFit",
    "rating": 4.5,
    "reviews": 118,
    "stock": 36,
    "image": "/products/yogamat.jpg",
    "description": "This high-quality yoga mat provides excellent grip and cushioning for yoga, stretching, and home workouts. Lightweight and easy to carry, it supports comfort and stability during exercises."
  },
  {
    "title": "Complete Face Care Combo Set",
    "price": 2799,
    "category": "Beauty",
    "brand": "GlowCare",
    "rating": 4.4,
    "reviews": 157,
    "stock": 24,
    "image": "/products/skincare.jpg",
    "description": "A complete face care solution designed to cleanse, nourish, and protect your skin. This combo set is suitable for daily use and helps maintain a healthy, glowing complexion."
  },
  {
    "title": "Digital Body Weight Scale",
    "price": 1599,
    "category": "Health",
    "brand": "HealthTrack",
    "rating": 4.3,
    "reviews": 112,
    "stock": 29,
    "image": "/products/scale.jpg",
    "description": "Track your weight accurately with this digital body weight scale. It features a clear LED display, high precision sensors, and a sleek design suitable for home use."
  },
  {
    "title": "Kids Educational Learning Toy Set",
    "price": 1999,
    "category": "Toys",
    "brand": "EduPlay",
    "rating": 4.6,
    "reviews": 84,
    "stock": 33,
    "image": "/products/toy.jpg",
    "description": "Designed to enhance creativity and learning, this educational toy set helps kids develop problem-solving and motor skills while having fun."
  },
  {
    "title": "Fast Charging Power Bank 10000mAh",
    "price": 2299,
    "category": "Electronics",
    "brand": "PowerGo",
    "rating": 4.5,
    "reviews": 199,
    "stock": 38,
    "image": "/products/powerbank.jpg",
    "description": "A reliable power bank with 10000mAh capacity, supporting fast charging for smartphones and other devices. Compact and travel-friendly, it ensures you stay powered throughout the day."
  }
]
